{
  "architectures": [
    "BertCNNForMultiLabel"
  ],
  "conv_output_channels": 256,
  "hidden_size": 768,
  "id2label": {
    "0": "감사한",
    "1": "그저 그런",
    "2": "기쁜",
    "3": "당황한",
    "4": "만족스러운",
    "5": "분노한",
    "6": "불안한",
    "7": "스트레스 받는",
    "8": "슬픈",
    "9": "외로운",
    "10": "우울한",
    "11": "자신하는",
    "12": "편안한",
    "13": "흥분한"
  },
  "kernel_size": 3,
  "label2id": {
    "감사한": 0,
    "그저 그런": 1,
    "기쁜": 2,
    "당황한": 3,
    "만족스러운": 4,
    "분노한": 5,
    "불안한": 6,
    "스트레스 받는": 7,
    "슬픈": 8,
    "외로운": 9,
    "우울한": 10,
    "자신하는": 11,
    "편안한": 12,
    "흥분한": 13
  },
  "model_type": "bertcnn",
  "pretrained_model_name": "hun3359/klue-bert-base-sentiment",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4"
}
